	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C++ Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 19.0.1.144 Build 20181018";
# mark_description "";
# mark_description "-mavx -g -S";
	.file "t.cpp"
	.section .text._Z8printVecI7__m256iEvT_i, "xaG",@progbits,_Z8printVecI7__m256iEvT_i,comdat
..TXTST0:
.L_2__routine_start__Z8printVecI7__m256iEvT_i_0:
# -- Begin  _Z8printVecI7__m256iEvT_i
	.section .rodata, "a"
	.align 4
	.align 4
.L_2__STRING.0:
	.word	10
	.type	.L_2__STRING.0,@object
	.size	.L_2__STRING.0,2
	.space 2, 0x00 	# pad
	.align 4
.L_2__STRING.1:
	.long	2122789
	.type	.L_2__STRING.1,@object
	.size	.L_2__STRING.1,4
	.section .text._Z8printVecI7__m256iEvT_i, "xaG",@progbits,_Z8printVecI7__m256iEvT_i,comdat
# mark_begin;

	.weak _Z8printVecI7__m256iEvT_i
# --- printVec<__m256i>(__m256i, int)
_Z8printVecI7__m256iEvT_i:
# parameter 1(vec): %ymm0
# parameter 2(len): %edi
..B1.1:                         # Preds ..B1.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value__Z8printVecI7__m256iEvT_i.2:
..L3:
                                                          #6.34
..LN0:
	.file   1 "t.cpp"
	.loc    1  6  is_stmt 1
        pushq     %rbx                                          #6.34
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbx                                    #6.34
	.cfi_def_cfa 3, 16
	.cfi_offset 3, -16
..LN2:

        call      _Z8printVecI7__m256iEvT_i                     #31.2
..___tag_value__Z7shiftELv.35:
..LN173:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip
..B2.7:                         # Preds ..B2.6
                                # Execution count [0.00e+00]
..LN174:
	.loc    1  32  is_stmt 1
        lea       -48(%rbp), %rax                               #32.13
..LN175:
        addq      $16, %rax                                     #32.13
..LN176:
        movl      (%rax), %eax                                  #32.13
..LN177:
        vzeroupper                                              #32.13
..LN178:
	.loc    1  32  epilogue_begin  is_stmt 1
        leave                                                   #32.13
	.cfi_restore 6
..LN179:
        movq      %rbx, %rsp                                    #32.13
..LN180:
        popq      %rbx                                          #32.13
	.cfi_def_cfa 7, 8
	.cfi_restore 3
..LN181:
        ret                                                     #32.13
..LN182:
                                # LOE
..LN183:
	.cfi_endproc
# mark_end;
	.type	_Z7shiftELv,@function
	.size	_Z7shiftELv,.-_Z7shiftELv
..LN_Z7shiftELv.184:
.LN_Z7shiftELv:
	.section .rodata, "a"
	.align 4
mem.226.0:
	.long	10
	.long	20
	.long	30
	.long	40
	.long	50
	.long	60
	.long	70
	.long	80
	.align 4
mask.226.0:
	.long	0
	.long	0
	.long	1
	.long	1
	.long	1
	.long	1
	.long	1
	.long	1
	.align 4
shuf_idx.226.0:
	.long	0
	.long	0
	.long	0
	.long	1
	.long	2
	.long	3
	.long	4
	.long	5
	.data
# -- End  _Z7shiftELv
	.text
.L_2__routine_start_main_2:
# -- Begin  main
	.text
# mark_begin;

	.globl main
# --- main()
main:
..B3.1:                         # Preds ..B3.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.43:
..L44:
                                                         #35.12
..LN185:
	.loc    1  35  is_stmt 1
        pushq     %rbp                                          #35.12
	.cfi_def_cfa_offset 16
..LN186:
        movq      %rsp, %rbp                                    #35.12
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN187:
        subq      $16, %rsp                                     #35.12
..___tag_value_main.49:
..LN188:
	.loc    1  36  prologue_end  is_stmt 1
#       shiftEL()
        call      _Z7shiftELv                                   #36.10
..___tag_value_main.50:
..LN189:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip eax
..B3.5:                         # Preds ..B3.1
                                # Execution count [0.00e+00]
..LN190:
        movl      %eax, -16(%rbp)                               #36.10
..LN191:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip
..B3.2:                         # Preds ..B3.5
                                # Execution count [0.00e+00]
..LN192:
        movl      -16(%rbp), %eax                               #36.10
..LN193:
	.loc    1  36  epilogue_begin  is_stmt 1
        leave                                                   #36.10
	.cfi_restore 6
..LN194:
        ret                                                     #36.10
..LN195:
                                # LOE
..LN196:
	.cfi_endproc
# mark_end;
	.type	main,@function
	.size	main,.-main
..LNmain.197:
.LNmain:
	.data
# -- End  main
	.data
	.section .note.GNU-stack, ""
// -- Begin DWARF2 SEGMENT .debug_info
	.section .debug_info
.debug_info_seg:
	.align 1
	.4byte 0x000002b5
	.2byte 0x0004
	.4byte .debug_abbrev_seg
	.byte 0x08
//	DW_TAG_compile_unit:
	.byte 0x01
//	DW_AT_comp_dir:
	.4byte .debug_str
//	DW_AT_name:
	.4byte .debug_str+0x1a
//	DW_AT_producer:
	.4byte .debug_str+0x20
	.4byte .debug_str+0x8e
//	DW_AT_language:
	.byte 0x04
//	DW_AT_use_UTF8:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte 0x0000000000000000
//	DW_AT_ranges:
	.4byte .debug_ranges_seg
	.byte 0x01
//	DW_AT_stmt_list:
	.4byte .debug_line_seg
//	DW_TAG_namespace:
	.byte 0x02
//	DW_AT_name:
	.4byte 0x00647473
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x9a
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0xa4
//	DW_TAG_subprogram:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0xaf
	.4byte .debug_str+0xb8
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LN_Z8printVecI7__m256iEvT_i.67-..L3
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000b0
//	DW_AT_name:
	.4byte 0x00636576
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x50
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000017b
//	DW_AT_name:
	.4byte 0x006e656c
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x40
//	DW_TAG_template_type_param:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x188
//	DW_AT_type:
	.4byte 0x000000b0
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000b0
//	DW_AT_name:
	.4byte 0x00636576
//	DW_AT_location:
	.4byte 0x7f987603
//	DW_TAG_lexical_block:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN19
//	DW_AT_high_pc:
	.8byte ..LN60
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x0000017b
//	DW_AT_location:
	.4byte 0x7f947603
	.byte 0x00
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x37
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0xd2
//	DW_AT_type:
	.4byte 0x000000bb
//	DW_TAG_union_type:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0xd2
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0xda
//	DW_AT_type:
	.4byte 0x00000142
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0xf7
//	DW_AT_type:
	.4byte 0x00000152
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x105
//	DW_AT_type:
	.4byte 0x00000162
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x115
//	DW_AT_type:
	.4byte 0x00000172
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x11f
//	DW_AT_type:
	.4byte 0x00000182
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x129
//	DW_AT_type:
	.4byte 0x0000018b
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x140
//	DW_AT_type:
	.4byte 0x0000019b
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x159
//	DW_AT_type:
	.4byte 0x000001ab
//	DW_TAG_member:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x170
//	DW_AT_type:
	.4byte 0x000001bb
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000014b
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0xf2
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000015b
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x100
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000016b
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x10f
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000017b
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000014b
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000194
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x132
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000001a4
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x14a
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000001b4
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x163
//	DW_TAG_array_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000001c4
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x0d
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0e
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x17a
//	DW_TAG_subprogram:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000017b
//	DW_AT_name:
	.4byte .debug_str+0x18d
	.4byte .debug_str+0x195
//	DW_AT_low_pc:
	.8byte ..L24
//	DW_AT_high_pc:
	.8byte ..LN_Z7shiftELv.184-..L24
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a1
//	DW_AT_type:
	.4byte 0x000000b0
//	DW_AT_location:
	.4byte 0x7d907603
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x006d656d
//	DW_AT_type:
	.4byte 0x0000027c
//	DW_AT_location:
	.4byte 0x7c907603
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1aa
//	DW_AT_type:
	.4byte 0x000000b0
//	DW_AT_location:
	.4byte 0x7dd07603
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x16
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1b2
//	DW_AT_type:
	.4byte 0x00000285
//	DW_AT_location:
