	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C++ Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 19.1.0.166 Build 20191121";
# mark_description "";
# mark_description "-I /home/jatinbha/softwares/iaca-lin64/ -x c++ -mavx512f -o copy512_scalar_lt64.s -S -g";
	.file "copy512_scalar_lt64.c"
	.text
..TXTST0:
.L_2__routine_start__Z8init_memPcc_0:
# -- Begin  _Z8init_memPcc
	.text
# mark_begin;

	.globl _Z8init_memPcc
# --- init_mem(char *, char)
_Z8init_memPcc:
# parameter 1(mem): %rdi
# parameter 2(val): %esi
..B1.1:                         # Preds ..B1.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value__Z8init_memPcc.2:
..L3:
                                                          #19.37
..LN0:
	.file   1 "copy512_scalar_lt64.c"
	.loc    1  19  is_stmt 1
        pushq     %rbp                                          #19.37
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #19.37
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        subq      $32, %rsp                                     #19.37
..LN3:
        movq      %rdi, -24(%rbp)                               #19.37
..LN4:
        movb      %sil, -16(%rbp)                               #19.37
..LN5:
	.loc    1  20  prologue_end  is_stmt 1
        movl      $0, -32(%rbp)                                 #20.13
..LN6:

	.2byte 0x7602
	.byte 0x68
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000a0
//	DW_AT_name:
	.4byte 0x006c6176
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
//	DW_TAG_lexical_block:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN5
//	DW_AT_high_pc:
	.8byte ..LN_Z8init_memPcc.25
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x60
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000000a0
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x12a
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x12f
//	DW_TAG_base_type:
	.byte 0x0a
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_subprogram:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_name:
	.4byte .debug_str+0x13d
	.4byte .debug_str+0x149
//	DW_AT_low_pc:
	.8byte ..L15
//	DW_AT_high_pc:
	.8byte ..LN_Z11scalar_copyPcS_i.59-..L15
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_AT_name:
	.4byte 0x00747364
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x68
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_AT_name:
	.4byte 0x00637273
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
//	DW_TAG_formal_parameter:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_name:
	.4byte 0x006e656c
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x78
//	DW_TAG_lexical_block:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN32
//	DW_AT_high_pc:
	.8byte ..LN52
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x60
	.byte 0x00
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_name:
	.4byte .debug_str+0x15e
	.4byte .debug_str+0x15e
//	DW_AT_low_pc:
	.8byte ..L27
//	DW_AT_high_pc:
	.8byte ..LNmain.189-..L27
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_name:
	.4byte .debug_str+0x163
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x48
//	DW_TAG_formal_parameter:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000001ec
//	DW_AT_name:
	.4byte .debug_str+0x168
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x50
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00736572
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_location:
	.4byte 0x7fa07603
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x16d
//	DW_AT_type:
	.4byte 0x000001fb
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x58
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00637273
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x68
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00747364
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x78
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x176
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_location:
	.4byte 0x7fb07603
//	DW_TAG_lexical_block:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN138
//	DW_AT_high_pc:
	.8byte ..LN173
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x17f
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_location:
	.4byte 0x7fb47603
//	DW_TAG_lexical_block:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN144
//	DW_AT_high_pc:
	.8byte ..LN168
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x184
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_AT_location:
	.4byte 0x7fb87603
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000001f6
//	DW_TAG_const_type:
	.byte 0x0f
//	DW_AT_type:
	.4byte 0x000000a0
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x138
//	DW_TAG_variable:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0xaa
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x189
//	DW_AT_type:
	.4byte 0x0000020f
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x00000214
//	DW_TAG_structure_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0xf6
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0xd8
//	DW_AT_name:
	.4byte .debug_str+0x190
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xf7
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x199
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfc
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x1a0
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x1ad
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfe
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x1ba
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xff
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x1c8
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0100
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x1d7
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x1e5
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0102
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x1f3
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0103
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x200
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x20c
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0106
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x21a
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0107
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0x22a
//	DW_AT_type:
	.4byte 0x0000009b
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0109
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x237
//	DW_AT_type:
	.4byte 0x000003d7
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x010b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x68
//	DW_AT_name:
	.4byte .debug_str+0x25c
//	DW_AT_type:
	.4byte 0x0000020f
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x010d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x70
//	DW_AT_name:
	.4byte .debug_str+0x263
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0111
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x74
//	DW_AT_name:
	.4byte .debug_str+0x26b
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0113
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x78
//	DW_AT_name:
	.4byte .debug_str+0x273
//	DW_AT_type:
	.4byte 0x0000040f
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0117
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01802303
//	DW_AT_name:
	.4byte .debug_str+0x287
//	DW_AT_type:
	.4byte 0x0000041a
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0118
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01822303
//	DW_AT_name:
	.4byte .debug_str+0x2a2
//	DW_AT_type:
	.4byte 0x000000a0
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0119
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01832303
//	DW_AT_name:
	.4byte .debug_str+0x2b1
//	DW_AT_type:
	.4byte 0x00000421
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x011d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01882303
//	DW_AT_name:
	.4byte .debug_str+0x2bb
//	DW_AT_type:
	.4byte 0x0000042a
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0126
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01902303
//	DW_AT_name:
	.4byte .debug_str+0x277
//	DW_AT_type:
	.4byte 0x00000441
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x012f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01982303
//	DW_AT_name:
	.4byte .debug_str+0x2db
//	DW_AT_type:
	.4byte 0x0000044c
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0130
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01a02303
//	DW_AT_name:
	.4byte .debug_str+0x2e2
//	DW_AT_type:
	.4byte 0x0000044c
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0131
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01a82303
//	DW_AT_name:
	.4byte .debug_str+0x2e9
//	DW_AT_type:
	.4byte 0x0000044c
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01b02303
//	DW_AT_name:
	.4byte .debug_str+0x2f0
//	DW_AT_type:
	.4byte 0x0000044c
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0133
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01b82303
//	DW_AT_name:
	.4byte .debug_str+0x2f7
//	DW_AT_type:
	.4byte 0x00000451
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0135
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01c02303
//	DW_AT_name:
	.4byte .debug_str+0x305
//	DW_AT_type:
	.4byte 0x000000ae
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0137
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.4byte 0x01c42303
//	DW_AT_name:
	.4byte .debug_str+0x30b
//	DW_AT_type:
	.4byte 0x0000045c
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000003dc
//	DW_TAG_structure_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0xa1
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x240
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xa2
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x24b
//	DW_AT_type:
	.4byte 0x000003d7
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xa3
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x251
//	DW_AT_type:
	.4byte 0x0000020f
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xa7
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x257
//	DW_AT_type:
	.4byte 0x000000ae
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x8c
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x27f
//	DW_AT_type:
	.4byte 0x000001fb
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x293
//	DW_TAG_array_type:
	.byte 0x15
//	DW_AT_type:
	.4byte 0x000000a0
//	DW_AT_byte_size:
	.byte 0x01
//	DW_TAG_subrange_type:
	.byte 0x16
//	DW_AT_upper_bound:
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x0000042f
//	DW_TAG_typedef:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x9b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x2c1
//	DW_AT_type:
	.4byte 0x0000043a
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x2cc
//	DW_TAG_typedef:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x8d
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x2d1
//	DW_AT_type:
	.4byte 0x000001fb
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x0000043a
//	DW_TAG_typedef:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x2fe
//	DW_AT_type:
	.4byte 0x000000a7
//	DW_TAG_array_type:
	.byte 0x15
//	DW_AT_type:
	.4byte 0x000000a0
//	DW_AT_byte_size:
	.byte 0x14
//	DW_TAG_subrange_type:
	.byte 0x16
//	DW_AT_upper_bound:
	.byte 0x13
	.byte 0x00
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x10
	.byte 0x17
	.2byte 0x0000
	.byte 0x02
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x04
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x05
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x08
	.byte 0x02
	.byte 0x18
	.2byte 0x0000
	.byte 0x06
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.2byte 0x0000
	.byte 0x07
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.byte 0x02
	.byte 0x18
	.2byte 0x0000
	.byte 0x08
	.byte 0x0f
	.byte 0x00
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x09
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0a
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x0b
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0c
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0d
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.byte 0x02
	.byte 0x18
	.2byte 0x0000
	.byte 0x0e
	.byte 0x34
	.byte 0x00
	.byte 0x3b
